uat_chat/Documents/уатУстановкаЗависимостейОборотовПоСтатьям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>уатУстановкаЗависимостейОборотовПоСтатьям</Name>
			<Comment>Установка зависимостей оборотов по статьям (уат)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.уатЗависимостиОборотовПоСтатьямБюджетирования</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Comment>Сценарий</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяОборотовВлияющая</Name>
					<Comment>Статья оборотов влияющая</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСтатьиОборотовПоБюджетам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦФО</Name>
					<Comment>ЦФО</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Comment>Проект</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
						<v8:Type>cfg:CatalogRef.уатТипыТС</v8:Type>
						<v8:Type>cfg:CatalogRef.уатМоделиТС</v8:Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗависимостиОборотовПоСтатьям</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗависимаяНоменклатура</Name>
							<Comment>Зависимая номенклатура</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
								<v8:Type>cfg:CatalogRef.уатТипыТС</v8:Type>
								<v8:Type>cfg:CatalogRef.уатМоделиТС</v8:Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗависимаяСтатьяОборотов</Name>
							<Comment>Зависимая статья оборотов</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСтатьиОборотовПоБюджетам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗависимыйКонтрагент</Name>
							<Comment>Зависимый контрагент</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗависимыйПроект</Name>
							<Comment>Зависимый проект</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗависимыйЦФО</Name>
							<Comment>Зависимый ЦФО</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеИзмененияПоПериодам</Name>
							<Comment>Значение изменения по периодам</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ПрофилиИзмененияПлановПоПериодам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентДляРасчетаКоличества</Name>
							<Comment>Коэффициент для расчета количества</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентДляРасчетаСуммы</Name>
							<Comment>Коэффициент для расчета суммы</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитВлияющейСтатьиДляРасчетаКоличества</Name>
							<Comment>Реквизит влияющей статьи для расчета количества</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.РеквизитыДляРасчетаЗависимыхСтатейБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитВлияющейСтатьиДляРасчетаСуммы</Name>
							<Comment>Реквизит влияющей статьи для расчета суммы</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.РеквизитыДляРасчетаЗависимыхСтатейБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

uat_chat/Documents/уатУстановкаЗависимостейОборотовПоСтатьям/Ext/ManagerModule.bsl
// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	мЗапрос = Новый Запрос;
	мЗапрос.Текст = 
	"ВЫБРАТЬ
	|	уатУстановкаЗависимостейОборотовПоСтатьямЗависимостиОборотовПоСтатьям.Ссылка КАК Регистратор,
	|	уатУстановкаЗависимостейОборотовПоСтатьямЗависимостиОборотовПоСтатьям.Ссылка.Дата КАК Период,
	|	уатУстановкаЗависимостейОборотовПоСтатьямЗависимостиОборотовПоСтатьям.Ссылка.СтатьяОборотовВлияющая КАК ИсхСтатьяОборотов,
	|	уатУстановкаЗависимостейОборотовПоСтатьямЗависимостиОборотовПоСтатьям.Ссылка.Сценарий,
	|	уатУстановкаЗависимостейОборотовПоСтатьямЗависимостиОборотовПоСтатьям.Ссылка.Проект,
	|	уатУстановкаЗависимостейОборотовПоСтатьямЗависимостиОборотовПоСтатьям.Ссылка.ЦФО,
	|	уатУстановкаЗависимостейОборотовПоСтатьямЗависимостиОборотовПоСтатьям.Ссылка.Контрагент,
	|	уатУстановкаЗависимостейОборотовПоСтатьямЗависимостиОборотовПоСтатьям.Ссылка.Номенклатура,
	|	уатУстановкаЗависимостейОборотовПоСтатьямЗависимостиОборотовПоСтатьям.ЗависимаяСтатьяОборотов,
	|	уатУстановкаЗависимостейОборотовПоСтатьямЗависимостиОборотовПоСтатьям.ЗависимаяНоменклатура,
	|	уатУстановкаЗависимостейОборотовПоСтатьямЗависимостиОборотовПоСтатьям.ЗависимыйКонтрагент,
	|	уатУстановкаЗависимостейОборотовПоСтатьямЗависимостиОборотовПоСтатьям.ЗависимыйПроект,
	|	уатУстановкаЗависимостейОборотовПоСтатьямЗависимостиОборотовПоСтатьям.ЗависимыйЦФО,
	|	уатУстановкаЗависимостейОборотовПоСтатьямЗависимостиОборотовПоСтатьям.РеквизитВлияющейСтатьиДляРасчетаСуммы,
	|	уатУстановкаЗависимостейОборотовПоСтатьямЗависимостиОборотовПоСтатьям.КоэффициентДляРасчетаСуммы,
	|	уатУстановкаЗависимостейОборотовПоСтатьямЗависимостиОборотовПоСтатьям.РеквизитВлияющейСтатьиДляРасчетаКоличества,
	|	уатУстановкаЗависимостейОборотовПоСтатьямЗависимостиОборотовПоСтатьям.КоэффициентДляРасчетаКоличества,
	|	уатУстановкаЗависимостейОборотовПоСтатьямЗависимостиОборотовПоСтатьям.ЗначениеИзмененияПоПериодам
	|ИЗ
	|	Документ.уатУстановкаЗависимостейОборотовПоСтатьям.ЗависимостиОборотовПоСтатьям КАК уатУстановкаЗависимостейОборотовПоСтатьямЗависимостиОборотовПоСтатьям
	|ГДЕ
	|	уатУстановкаЗависимостейОборотовПоСтатьямЗависимостиОборотовПоСтатьям.Ссылка = &Ссылка";

	мЗапрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗависимостейОборотов", мЗапрос.Выполнить().Выгрузить());
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
		
	Заголовок = уатОбщегоНазначенияТиповые.уатПредставлениеДокументаПриПроведении(ДокументСсылка);

КонецПроцедуры
